Repository: Abd210/prayer_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Advanced Islamic App
ar: تطبيق إسلامي متقدم

source: Settings
ar: الإعدادات

# settingsTitle
source: Settings
ar: الإعدادات

source: Appearance
ar: المظهر

source: Language
ar: اللغة

source: About App
ar: حول التطبيق

# selectColorTheme
source: Select App Color Theme
ar: اختر نسق الألوان

source: Custom Theme
ar: نسق مخصّص

source: Enable Dark Mode
ar: تفعيل الوضع الداكن

source: Enable Light Mode
ar: تفعيل الوضع الفاتح

source: Enable Notifications
ar: تفعيل الإشعارات

source: Enable Daily Hadith
ar: تفعيل حديث اليوم

source: High Accuracy Calculation
ar: دقة حساب عالية

# highAccuracySubtitle
source: Includes elevation for more precise times
ar: يشمل الارتفاع لحساب أوقات أكثر دقة

source: Frequent Location Updates
ar: تحديثات متكررة للموقع

# frequentLocationSubtitle
source: Higher accuracy but more battery usage
ar: دقة أعلى ولكن استهلاك أكبر للبطارية

source: Other Settings
ar: إعدادات أخرى

# languageTitle
source: Language
ar: اللغة

source: Select Language
ar: اختر اللغة

source: Calculation Method
ar: طريقة الحساب

# calculationMethodLabel
source: Prayer Calculation Method
ar: طريقة حساب أوقات الصلاة

# calculationMethodTitle
source: Prayer Calculation Method
ar: طريقة حساب أوقات الصلاة

# asrCalculationTitle
source: Asr Prayer Calculation
ar: حساب صلاة العصر

source: Madhab
ar: المذهب

source: Use 24‑hour Format
ar: استخدام صيغة 24 ساعة

# use24hFormat
source: Use 24‑hour Format
ar: استخدام صيغة 24 ساعة

# timeFormatTitle
source: Time Format
ar: صيغة الوقت

# shafiiLabel
source: Shafii
ar: الشافعي

# shafiiDescription
source: Standard shadow length (majority of scholars)
ar: طول الظل القياسي (رأي أغلب العلماء)

# hanafiLabel
source: Hanafi
ar: الحنفي

# hanafiDescription
source: Double shadow length
ar: ضعف طول الظل

source: Notifications
ar: الإشعارات

# languageEnglish
source: English
ar: الإنجليزية

# languageArabic
source: Arabic
ar: العربية

source: Pick
ar: اختيار

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

# createCustomTheme
source: Create Your Own Theme
ar: أنشئ نسقك المخصَّص

# chooseLightTheme
source: Choose a Light Theme
ar: اختر نسقًا فاتحًا

# currentTheme
source: Current:
ar: الحالي:

source: Primary
ar: أساسي

source: Secondary
ar: ثانوي

source: Background
ar: خلفية

source: Surface
ar: سطح

# nextPrayerLabel
source: Next Prayer: {prayerName}
ar: الصلاة التالية: {prayerName}

# startsIn
source: Starts in {countdown}
ar: يبدأ خلال {countdown}

source: Return to Today
ar: العودة إلى اليوم

source: Test Notification
ar: اختبار الإشعار

source: Reload
ar: إعادة تحميل

# statisticsTooltip
source: Statistics
ar: الإحصائيات

source: Sunnah Times
ar: أوقات السنن

# tipOfDay
source: Tip of the Day:
ar: نصيحة اليوم:

# prayerTimeTitle
source: Prayer Time
ar: وقت الصلاة

# prayerNotificationBody
source: It's time for {prayerName} prayer in {city}
ar: حان وقت صلاة {prayerName} في {city}

source: Location unavailable
ar: الموقع غير متاح

# prayerFajr
source: Fajr
ar: الفجر

# prayerSunrise
source: Sunrise
ar: الشروق

# prayerDhuhr
source: Dhuhr
ar: الظهر

# prayerAsr
source: Asr
ar: العصر

# prayerMaghrib
source: Maghrib
ar: المغرب

# prayerIsha
source: Isha
ar: العشاء

# middleNight
source: Middle of Night
ar: منتصف الليل

# lastThirdNight
source: Last Third of Night
ar: ثلث الليل الأخير

# tipEstablishPrayer
source: "Establish prayer and give charity."
ar: "﴿أَقِمِ الصَّلَاةَ وَآتِ الزَّكَاةَ﴾"

# tipBetterThanSleep
source: "Prayer is better than sleep."
ar: "«الصلاة خيرٌ من النوم»"

# tipCallUponMe
source: "Call upon Me, I will respond."
ar: "﴿ادْعُونِي أَسْتَجِبْ لَكُمْ﴾"

# tipReflectQuran
source: Reflect upon the Quran daily for spiritual growth.
ar: تدبّر القرآن يوميًّا لنموٍّ روحيٍّ أكبر.

# tipKhushu
source: Strive for khushū` (humility) in prayer.
ar: اسعَ إلى الخشوع في الصلاة.

# tipSharePrayer
source: Share your knowledge of prayer times with friends.
ar: شارك مواعيد الصلاة مع أصدقائك.

# tipSunnah
source: Keep consistent with Sunnah prayers for extra reward.
ar: داوم على صلوات السنن لتحصل على مزيد من الأجر.

# navPrayers
source: Prayers
ar: الصلوات

# navAzkar
source: Azkār
ar: أذكار

# navQibla
source: Qibla
ar: قِبلة

# navQuran
source: Quran
ar: القرآن

# navSettings
source: Settings
ar: الإعدادات

source: Locating…
ar: جارٍ التحديد…

# refreshCompass
source: Refresh location & heading
ar: تحديث الموقع والاتجاه

# headingLabel
source: Heading
ar: اتجاه الجهاز

# qiblaLabel
source: Qibla
ar: القبلة

# facingQibla
source: You are facing the Qibla!
ar: أنت متجه نحو القبلة!

# deltaFromQibla
source: Δ {degrees}° from Qibla
ar: Δ {degrees}° عن القبلة

# compassWarnInterference
source: Compass accuracy may drop if you're near magnetic fields or metal objects.
ar: قد تقل دقة البوصلة إن وُجدت أجسام معدنية أو مجالات مغناطيسية قريبة.

# compassWarnNeedle
source: The orange needle points toward the Qibla direction.
ar: الإبرة البرتقالية تشير إلى اتجاه القبلة.

# azkarTasbihTitle
source: Azkar & Tasbih
ar: الأذكار والتسبيح

source: Free Tasbih
ar: تسبيح حرّ

# statsTitle
source: Azkar Statistics
ar: إحصاءات الأذكار

# statsNoData
source: No statistics yet. Finish any Azkar list and come back!
ar: لا توجد إحصاءات بعد. أكمِل أي قائمة أذكار ثم عد لاحقًا!

# tabDaily
source: Daily
ar: يومي

# tabWeekly
source: Weekly
ar: أسبوعي

# tabMonthly
source: Monthly
ar: شهري

# kpiDays
source: Days
ar: الأيام

# kpiStreak
source: Streak
ar: السلسلة

# kpiBest
source: Best
ar: الأفضل

source: Week
ar: الأسبوع

# weekShort
source: W
ar: أ

# needMoreData
source: Need more data to draw a {period} trend
ar: تحتاج إلى مزيد من البيانات لرسم اتجاه {period}

source: {percent} % completed
ar: اكتمل{percent}٪

# periodDaily
source: daily
ar: يومي

# periodWeekly
source: weekly
ar: أسبوعي

# periodMonthly
source: monthly
ar: شهري

# tasbihTitle
source: Tasbih Advanced
ar: تسبيح متقدم

source: Global Tasbih
ar: التسبيح العام

source: Sub‑Counters
ar: عدادات فرعية

source: Reset All
ar: إعادة الضبط

# tasbihHint
source: Tap the main box for a global count. Tap any sub box for specific counts (33 each).
ar: انقر على المربع الرئيسي للعد العام. وانقر أي مربع فرعي للعد المحدد (٣٣ مرة).

source: Compact View
ar: عرض مضغوط

source: Expanded View
ar: عرض موسَّع

# azkarCopy
source: Copy
ar: نسخ

# azkarCopied
source: Azkar text copied to clipboard!
ar: تم نسخ نص الذكر!

# tapAnywhere
source: Tap Anywhere to Count
ar: اضغط في أي مكان للعد

# azkarReminder
source: Remembrance of Allah is the greatest (Qur'an 29:45).
ar: ﴿وَلَذِكْرُ اللَّهِ أَكْبَرُ﴾ (العنكبوت ٤٥)

# azkarCompletedTitle
source: {title} Completed!
ar: اكتمل {title}!

# azkarCompletedContent
source: You have finished all azkār in this category.
ar: لقد أنهيت جميع الأذكار في هذا القسم.

source: OK
ar: حسناً

# azkarTab
source: Azkar
ar: أذكار

# tasbihTab
source: Tasbih
ar: تسبيح

source: Custom Azkar
ar: أذكار مخصصة

source: Manage Custom Azkar
ar: إدارة الأذكار المخصصة

# createAndEditCustomAzkar
source: Create and edit your own azkar collections
ar: إنشاء وتعديل مجموعات الأذكار الخاصة بك

source: Create Azkar
ar: إنشاء ذكر جديد

source: Edit Azkar
ar: تعديل الذكر

# noCustomAzkar
source: You don't have any custom azkar yet. Create your first one!
ar: ليس لديك أي أذكار مخصصة بعد. أنشئ أول ذكر لك!

source: Create New Azkar
ar: إنشاء ذكر جديد

# basicInfo
source: Basic Information
ar: المعلومات الأساسية

source: Title
ar: العنوان

source: Arabic Title
ar: العنوان بالعربية

source: Select Color
ar: اختر اللون

source: Select Icon
ar: اختر الأيقونة

source: Items
ar: العناصر

source: Add Item
ar: إضافة عنصر

source: Edit Item
ar: تعديل العنصر

# noItemsYet
source: You haven't added any items yet. Click the button above to add a new one.
ar: لم تضف أي عناصر بعد. انقر على الزر أعلاه لإضافة عنصر جديد.

# deleteConfirmation
source: Are you sure you want to delete '{title}'?
ar: هل أنت متأكد أنك تريد حذف '{title}'؟

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: deleted
ar: تم الحذف

# requiredField
source: This field is required
ar: هذا الحقل مطلوب

source: Arabic Text
ar: النص العربي

source: Description
ar: الوصف

source: Repeat
ar: التكرار

# enterArabicText
source: Enter Arabic text here...
ar: أدخل النص العربي هنا...

# addItemsFirst
source: Please add at least one item first
ar: الرجاء إضافة عنصر واحد على الأقل أولاً

# errorSaving
source: Error saving. Please try again.
ar: خطأ في الحفظ. يرجى المحاولة مرة أخرى.

# deleteItemConfirmation
source: Are you sure you want to delete this item?
ar: هل أنت متأكد أنك تريد حذف هذا العنصر؟

# quranTitle
source: Quran
ar: القرآن

# searchHint
source: Search for a verse
ar: ابحث عن آية

# searchNoResults
source: No verses found for '{query}'
ar: لم يتم العثور على آيات لـ "{query}"

# searchPrompt
source: Type a word or phrase to search in the Quran
ar: اكتب كلمة أو عبارة للبحث في القرآن

# searchSuggestions
source: Search verses containing: {query}
ar: بحث عن آيات تحتوي: {query}

# searchResultTitle
source: Surah {surah}: Verse {verse}
ar: سورة {surah}: آية {verse}

# juzLabel
source: Juz {number}
ar: جزء {number}

# juzSurahHeader
source: Surahs in Juz {juz}
ar: السور في الجزء {juz}

# versesLabel
source: {count} Verses
ar: {count} آية

source: Play Entire Surah
ar: تشغيل السورة كاملة

source: Prayer Time Adjustments
ar: تعديلات أوقات الصلاة

# adjustmentMinutes
source: Adjustment
ar: تعديل

source: Reset Adjustments
ar: إعادة ضبط التعديلات

source: Location Settings
ar: إعدادات الموقع

source: Manual Location
ar: تحديد الموقع يدويًا

source: Adhan Settings
ar: إعدادات الأذان

source: Enable Adhan
ar: تفعيل الأذان

source: Adhan Volume
ar: مستوى صوت الأذان

source: Test Adhan
ar: اختبار الأذان

source: Auto Next
ar: الانتقال التلقائي

source: Manual Next
ar: الانتقال اليدوي

source: Auto-detect Method
ar: اكتشاف تلقائي للطريقة

# autoDetectMethodSubtitle
source: Automatically detect calculation method based on your location
ar: تحديد طريقة الحساب تلقائياً حسب موقعك

source: Manual Calculation Method
ar: طريقة الحساب اليدوية

source: Detect Method Now
ar: اكتشاف الطريقة الآن

source: Detecting method...
ar: جاري اكتشاف الطريقة...

# methodUpdatedAuto
source: Calculation method updated automatically!
ar: تم تحديث طريقة الحساب تلقائياً!

# methodUnchanged
source: Calculation method unchanged
ar: لم يتم تغيير طريقة الحساب

# methodUpdatedForLocation
source: Calculation method updated automatically for your new location
ar: تم تحديث طريقة الحساب تلقائياً لموقعك الجديد

source: Azkar Reminders
ar: تذكير الأذكار

source: Enable Azkar Reminders
ar: تفعيل تذكير الأذكار

# azkarRemindersEnabled
source: Azkar reminders are enabled
ar: تذكير الأذكار مفعل

# azkarRemindersDisabled
source: Azkar reminders are disabled
ar: تذكير الأذكار معطل

source: Dhuhr Azkar Reminder
ar: تذكير أذكار الظهر

source: Maghrib Azkar Reminder
ar: تذكير أذكار المغرب

source: Reset to Defaults
ar: إعادة تعيين للافتراضي

source: Test Reminder
ar: اختبار التذكير

source: Azkar Reminder Info
ar: معلومات تذكير الأذكار

# azkarReminderInfoText
source: • Dhuhr: Morning azkar reminder before Dhuhr prayer • Maghrib: Evening azkar reminder before Maghrib prayer • Customizable: Adjust timing as you prefer • Daily: Reminders repeat every day
ar: • الظهر: تذكير بأذكار الصباح قبل صلاة الظهر • المغرب: تذكير بأذكار المساء قبل صلاة المغرب • قابل للتخصيص: اضبط الوقت حسب رغبتك • يومياً: تتكرر التذكيرات كل يوم

# azkarRemindersEnabledMsg
source: Azkar reminders enabled
ar: تم تفعيل تذكير الأذكار

# azkarRemindersDisabledMsg
source: Azkar reminders disabled
ar: تم إلغاء تذكير الأذكار

# resetToDefaultsMsg
source: Reset to default settings
ar: تم إعادة التعيين للافتراضي

source: Test reminder sent!
ar: تم إرسال تذكير تجريبي!

source: Test Background Notification
ar: اختبار الإشعار في الخلفية

# backgroundTestTitle
source: Background Test
ar: اختبار الإشعار في الخلفية

# backgroundTestBody
source: This is a test notification when the app is closed. You can close the app now and wait 30 seconds.
ar: هذا اختبار للإشعار عندما يكون التطبيق مغلقاً. يمكنك إغلاق التطبيق الآن والانتظار 30 ثانية.

# backgroundTestScheduled
source: Background notification test scheduled. Close the app and wait 30 seconds.
ar: تم جدولة اختبار الإشعار في الخلفية. أغلق التطبيق وانتظر 30 ثانية.
